[
    {
        "title": "Inconvenience in this Cummings Lodge road project",
        "date": "2024-02-28T02:08:02-04:00",
        "paragraphs": [
            "Dear Editor,",
            "It has been at least three months now that works started to widen the eastern half of Sixth Street, Cummings Lodge from the Hindu Temple to the Secondary School. It must be noted this is not a normal straight street but a long winding road connection this village to Industry. Works done so far are digging along both sides of the road, sand-filling and laying stones at the top.",
            "Editor, for the past month or so no work has been done. Residents including hundreds of schoolchildren have had to endure a lot of inconvenience as they were forced to traverse this part of the road with loose stones all around.",
            "To add insult to injury, last Saturday I observed that similar works started on the part of the road from the Temple to UG Road. I got angry and went straight to the work site to get some information from the staff. Editor I was shocked with the answer I got. The gentleman with a Trinidadian accent explained that they had asphalted the eastern half already but the Government has not tested the area for solidity as yet. He gave the name of the Engineering Company as what sounded like Aramco.",
            "Editor if this revelation of this site worker is accurate then it is clear that not only Contractors default on projects but the Government can be negligent of their responsibilities as well.",
            "Editor, when you listen to the hierarchy of this Government you would want to believe that they are perfect and always put the people first but in reality and on the ground it is far from so. Look at the project to repair part of UG Road from the Railway Embankment to the Seawall that was left in a mess. Look at the new Vryheid’s Lust Primary School where no work was done to complete this building during the August Break in 2023 but soon after the resumption of classes in September works restarted resulting in students being exposed to a series of health and safety hazards. That is probably why the school was never commissioned.",
            "Editor, there are so many instances where the Government’s incompetencies are exposed and if citizens continue to accept quantity instead of quality then monies including our hard-earned taxes we pay will continue to be wasted.",
            "Yours faithfully,",
            "R. Khan"
        ],
        "image_paths": [],
        "url": "https://www.stabroeknews.com/2024/02/28/opinion/letters/inconvenience-in-this-cummings-lodge-road-project/"
    },
    {
        "title": "Pit latrines at hinterland schools",
        "date": "2024-10-08T02:01:40-04:00",
        "paragraphs": [
            "It is conceivable that it would not have occurred to many Guyanese residing on ‘the coastal plain’ that both children and teachers in parts of the hinterland must endure the safety and health hazards as well as the indignity that attends the need to use pit latrines outside of schools’ and, seemingly, that there appears not to exist, up to this time, any immediate-term plan to remove this unacceptable obstacle to the delivery of education in a convivial environment in those areas. Here, and even as there may well occur a further vigorous and wider verbal discourse over this disturbing disclosure, the immediate priority must be to have these health and safety hazards  removed over as brief a period as possible, beginning immediately, and replaced by flush toilets.",
            "It is apposite to wonder whether the announcement in August by Education Minister, Priya Manickchand, that government is in the process of ‘transitioning’ pit latrines to flush toilets in hinterland areas will be accelerated now that the issue has been placed prominently in the public domain.",
            "Incidentally, the outbreak of a political ‘blame game’ is an altogether inappropriate response to this disclosure. Hinterland development – which includes the installation of sanitation requisites – ought to have been occurring incrementally, over time, so that by now there ought to have been some evidence of an upgrade in areas of hygiene and sanitation. On the other hand, it can be argued that by now, the availability of petro dollars would have allowed for much more expeditious expenditure on requisites associated with the safety and health of children (and their teachers) attending schools in hinterland regions.",
            "One issue that arises here has to do with whether, the incumbent administration, possessed of its petro resources, ought not to have made more headway in fixing this problem. Truth be told, it is taking an unacceptably protracted period to at least begin the process of bringing ‘flush’ toilets to schools in the hinterland. It should be said that what the Minister of Education had to say on this matter (Education Ministry surveying how many schools still have pit latrines: Stabroek News August 28, 2024) does not come even remotely close to getting to the core of it. Given the importance of replacing pit latrines with flush toilets, the process should have begun some time ago.",
            "To go further, the fact that there appears not to have been, up to this time, some kind of concrete plan to incrementally remove pit latrines from schools in the interior does not reflect well on the Ministry of Education despite what the Minister of Education had to say in her interview with the Stabroek News about the education system having been decentralized so that, “as such schools are managed by the regional governance system.” One would not have thought that decentralization would have removed the vested interest of the Ministry to stay engaged with procedures and processes that have to do with the development of those facilities associated with the advancement of the education system.",
            "One anticipates that questions will arise in some quarters as to whether there are not wider considerations associated with the installation of modern loos (the plural of loo, an informal British expression for toilet) including costs (which surely ought to be the lesser consideration) and technical/physical constraints (many of the locations where these pit latrines are situated are likely not to have access to ‘running’ water at this time) though the thought of these health hazards/actual danger to life and limb persisting for much longer is surely unthinkable and that whatever the costs (and effort) associated with upgrading, the exercise of removing and replacing these ‘pit latrines’ ought to be addressed with maximum alacrity.",
            "It has to be said, further, that the functionaries responsible, directly, for delivering education in those areas where pit latrines are still ‘in vogue’ must commence the exercise of speaking out now that the issue is out in the open. In the circumstances, arriving at ‘a figure’ for the replacement of pit latrines ought not to be (as we say in Guyana) ‘a day’s work.’ The point to be made here is that the issue of pit latrines at hinterland schools is just the kind of revelation that might ‘blow over,’ after an initial ‘hoo-ha.’ This might well result in the issue of pit latrines becoming sidelined. After all, and for all the historic denial, issues to do with the well-being of hinterland communities have always appeared to be treated as lesser concerns. That is, at least, how it usually appears.",
            "We should remind ourselves that we have only just had to endure a horrendous tragedy resulting from a fire in a Dormitory at an interior location that claimed a number of lives on account of what was widely felt to be, in large measure, a lack of official mindfulness in the matter of the safety of the children occupying the facility. In the extant instance of the pit latrines, as in the case of the Mahdia Dormitory Fire, it appears that the potential for tragedy that may range from the collapse of a pit latrine resulting in loss of life to outbreaks of pockets of diseases (if these may not have occurred already) may have an even more long-term harmful effect than the Mahdia Dorm Tragedy.",
            "One assumes that, hopefully, the pit latrines ‘audit’ which, presumably would have been ensuing for some time and would have come to an end by now (on the surface, at least, it does not appear to be an overwhelmingly weighty task) and that the numbers are on the Minister’s desk. This, one feels, should be sufficient to cause the process leading to the installation of flush toilets at schools across the hinterland to begin without further undue delay."
        ],
        "image_paths": [],
        "url": "https://www.stabroeknews.com/2024/10/08/opinion/editorial/pit-latrines-at-hinterland-schools/"
    },
    {
        "title": "Gov’t doing little to address negative impacts of gold mining – GHRA",
        "date": "2024-08-04T02:19:43-04:00",
        "paragraphs": [
            "The Guyana Human Rights Association (GHRA) is taking the government to task for failing to insulate the environment and Indigenous communities from the negative effects of gold mining and makes the case that the many benefits it accords the sector do little to encourage responsible action.",
            "In a release yesterday, GHRA referenced the recent statement from the Ministry of Natural Resources (MoNR) which catalogued the extensive perks, concessions and privileges extended to the gold-mining sector, including tax reductions, duty-free concessions, simplified licensing arrangements, expansion of available mining properties in conflicted areas such as Marudi Mountains, and removal of protective regulations. All this, the Association added, without mentioning the “huge environmental and human cost” perpetrated by this industry. It was noted too that the ministry’s statement concluded with a reminder that this unwavering support was “in keeping with the ruling party Manifesto prior to the last elections.” Further, the GHRA bemoaned the fact that even road-building in interior regions has become mining-driven rather than influenced by community or environmental considerations.  ",
            " The release pointed out that since all mining has a significant effect on the environment, the Environmental Protection Act 1996, (Section 11) and Schedule 4, (item 9) mandates that Environmental Impact Assessments (EIA) and Environmental Permits (EP) are to be undertaken for each and every mining operation. However, according to the annual reports of the Guyana Extractive Industries Transparency Initiative (GY-EITI), the Guyana Geology & Mines Com-mission (GGMC) has not enforced such requirements for many years for the thousands of small-scale mining claims or medium-scale mining permits covering millions of hectares. ",
            "GHRA lamented the fact that most of Guyana’s prized large rivers have been reduced to health and safety hazards by gold mining, with river banks and the actual course of rivers having been altered by illegal hydraulic mining. Added to this is the failures to apply the several GGMC Codes of Practice to the waste in mine tailings now spilling polluted sediment into the creeks and rivers. “No effort has been made to apply penalties for these transgressions despite the fact that River Navigation Act (cap. 50:01, 1998) and the State Lands Act 1903/1972 (Section 22) states ‘Everyone who willfully causes any impediment to the free use or navigation of any river or navigable creek, shall be liable to a fine of ninety-seven thousand five hundred dollars, unless he has previously obtained permission under this Act or the Forests Act to cause the impediment.’”",
            "It is the contention of the Association that mining disrupts riverine ecosystems, leading to habitat destruction, reduced water quality, and the loss of bio-diversity, which makes it imperative that the EIA process “be consistently, rigorously and transparently applied.” And although regular and thorough inspections, coupled with stringent penalties for non-compliance are required, they are currently ignored given the understaffing of the GGMC.",
            "The difficulty here, the GHRA said is that a handful of field Mines Officers and Wardens are expected to monitor an industry which has issued thousands of mining claims, and penalties for breaches of the various rules and regulations do not disincentivize breaches. As such there is a need for penalties to be much more severe, while prioritising the restoration of mining sites and enforcing robust environmental regulations and this can mitigate long-term environmental damage, protect vital water resources, and promote sustainable development.",
            "The release referred to an experiment undertaken by the GGMC some years ago to assess the cost of mine-site restoration. It was discovered that the cost of a small-scale restoration by a contracted company was estimated to be in the region of $6 million as compared to the “derisory” sum of $100,000 for restoration – the obligatory environmental bond – which is treated by the majority of miners as payment to the GGMC to get the job done.",
            "Moving on to the negative effects of mining on Indigenous communities, the release noted that longstanding claims by Indigenous communities are aggravated by land ownership policies, which have been progressively dominated since colonial times by the mineral potential of lands rather than ownership claims.  ",
            "Quiet enjoyment\n“The most severe consequences of the free-for-all in the mining sector are felt by Amerindian communities who have seen their land rights progressively eroded despite the catalogue of Statutes and Regulations that provide a legal defence.  Amerindian rights to ‘quiet enjoyment of their land and surroundings’ have trumped any mining claims in a series of laws. The Mining Regula-tion of 1905 stated ‘All land occupied or used by the Aboriginal Indians, and all land necessary for the quiet enjoyment by the Aboriginal Indians of any Indian settlement, shall be deemed to be lawfully occupied by them’(Section 199). Virtually the same language is reproduced in the Mining Act 1989 (Section 111) and similarly reproduced in the Water and Sewerage Act Cap. 30-01 2002 (Section 94).”",
            "The GHRA therefore, feels strongly that this “quiet enjoyment’ clause ought to constitute a deterrent to the GGMC’s issuance of small-scale mining claims or medium-scale mining permits before a due diligence check is completed in each requested area in or including a titled Amerindian Village (required in section 53 of the Amerindian Act 2006). However, it made sure to point out that in practice, as shown in the High Court cases in 2009 (Arau Village) and 2012-3 (Isseneru Village), such checks appear not to have been made and mining concessions have been issued by the GGMC over titled and untitled Amerindian lands without the knowledge of the Amerindian communities.",
            "The release homed in on mercury which is used in the gold recovery process and is known to pollute aquatic life, increase mortality and reproductive failures, and disrupts food chains. Here the government was criticised for not making enough effort to reduce the incidence and scale of mercury methylation into the environment and food chain, as well as taking the urgent remedial action the situation merits.",
            "Mention was made of a study undertaken in 2008 of mercury use by both terrestrial and river based hydraulic dredges where the amount estimated used annually was 11.37 tonnes. It referenced data that showed that official imports peaked in 2011 at 5.4 times the national requirement and grew to an estimated 35.82 tonnes in 2013. Over this period total imports were 504 tonnes with an excess of approximately 355 tonnes, which is 10 years’ worth of demand at 2013 levels. It also noted the allegation that much of this mercury is smuggled into Suriname where importation of mercury has been prohibited.   ",
            "“Environmental neglect and human suffering, together with bio-diversity and wildlife loss, is not even considered a cost by the gold industry or government.  These costs should be added to legal and illegal export of profits from gold mining, at no benefit whatever to their sovereign owners – the citizens of Guyana. In these circumstances the rationale for government subsidies to this industry requires urgent explanation. Moreover, they represent a stark contradiction to the Low Carbon Development Strategy 2030 (LCDS 2030) which figures prominently in government speeches at overseas events”, the GHRA said."
        ],
        "image_paths": [
            "./scraper/stabroak/Gov’t doing little to address negative impacts of gold mining – GHRA_img_2.png"
        ],
        "url": "https://www.stabroeknews.com/2024/08/04/news/guyana/govt-doing-little-to-address-negative-impacts-of-gold-mining-ghra/"
    },
    {
        "title": "Mining",
        "date": "2024-08-11T02:01:25-04:00",
        "paragraphs": [
            "The week before last the Ministry of Natural Resources issued a press release on mining.  It was a strange statement clearly directed at miners, but whose purpose for all of that was not immediately apparent. The release said that it wanted to advise that “illegal mining activities will not be tolerated and is calling on all miners to follow the prescribed process to legitimize their operations.”  The Ministry went on to urge “[t]hose who are engaging in such activities [to] desist, or risk being prosecuted by the state.” Given the record of mining oversight in this country, it was not a threat which would have left members of that community shaking in their boots.",
            "Having divested itself of the obligatory warning, the Ministry went on to assure small and medium-scale miners that it remained “eager to foster greater collaboration” with them in order “to ensure the sector remains a viable one.”  In other words the authorities by implication opened themselves to the interpretation that miners could ignore the warnings, because there was no intention at the political level of putting a brake on their operations. As if to reinforce that construction of their words, the remainder of the statement itemised at some length all the measures the government had taken to facilitate miners, and had nothing to say about any proposals it might have to deal with “illegal mining activities.”",
            "It is more than likely that all it had in mind with respect to illegalities in any case were the issues surrounding gold-smuggling after the allegations against the Mohammeds and Permanent Secretary Mae Toussaint Jnr Thomas came to light two months ago. Following that revelation various measures were announced relating to business being conducted in the interior and entities trading in vulnerable minerals, but these were not accompanied by anything addressing the myriad other issues pertaining to the mining sector. ",
            "As such, the press release listed a litany of benefits the PPP/C government had provided for miners such as the removal of VAT on various items, the dispensing with police clearance to transport fuel in their vehicles and the abolition of excise tax on a number of things. Then there was the support afforded by the provision of properties through lotteries and in other ways.",
            "If all of this was indeed intended as a comfort statement for miners, last week the GHRA stepped in to remind the government and the public about the cost of uncontrolled mining on the environment, the ecosystem, the Indigenous people and the country as a whole. With reference to all the benefits for miners enumerated in the statement the Association said this did little to encourage responsible action.",
            "And where illegalities were concerned, the GHRA adverted to the fact that a handful of field Mines Officers and Wardens were charged with monitoring an industry involving thousands of claims. In addition to that the penalties for breaches of the regulations did nothing to persuade people to conform to the rules, and that as it was, these needed to be far more severe.",
            "Anyone who has ever been into the mining areas of the interior – and even those peripheral to the mining areas – knows that the GHRA is not exaggerating. Since the majority of our population is based on the coast, and aside from the odd trip to Bartica or Kaieteur Falls, has little or no first-hand acquaintance with what goes on in the hinterland, its members are content to accept the government’s oft-quoted and self-satisfied remark that Guyana has preserved most of its forest intact.",
            "What has been preserved is mostly courtesy of the Amerindians, but some of them are under serious pressure from mining. Where conflicts arise, even when under the 2006 Amerindian Act an Indigenous community has the law on its side, mining interests invariably win out. To quote the Association: “The most severe consequences of the free-for-all in the mining sector are felt by Amerindian communities who have seen their land rights progressively eroded despite the catalogue of Statutes and Regulations that provide a legal defence.”",
            "The scandalous case of Chinese Landing has received a lot of public exposure, as has to a lesser degree, for example, Isseneru and villages in the vicinity of Marudi Mountain. Some communities such as the first-named have had recourse to the OAS Inter-American Commission on Human Rights, and/or the UN Committee on the Elimination of Racial Discrimination. These international agencies insist on the Indigenous right to Free Prior and Informed Consent, a habit not ingrained in the government, which views itself as conferring goodies of one kind or another, not consulting on decisions, never mind if these aid a community or do the opposite.",
            "The problem is that any demographic is seen by the government in electoral terms, and both the miners and the Amerindians are important in their own way in this regard. The difference is that Freedom House thinks it can control the Indigenous population, whereas the miners, who have in the past been seen as a PNCR constituency but are now not necessarily still so, have to be persuaded with ‘benefits’. In addition to this, small and medium-scale mining provides a profitable living for coastlanders who otherwise would possibly be unemployed and therefore potential troublemakers, while gold for its part is an important export commodity.",
            "The PPP’s myopic vision in relation to the interior has caused enormous environmental and ecological damage as described by GHRA. It might be mentioned in this connection that when this newspaper went into the Marudi mining area three years ago, we found that the miners had effectively decapitated Mazoa Mountain, which was close to disappearing from the physical maps of Guyana altogether. But it is not even mountains which are the main problem, according to the Association, since Guyana’s large rivers have become health and safety hazards because of gold mining, while in the case of other rivers their banks and courses have been altered by hydraulic mining.",
            "With the failure to observe several GGMC codes of practice, polluted tailings are spilling into the rivers and creeks in defiance of the law. Then there is the disruption to riverine ecosystems, said the GHRA, with the destruction of habitats and loss of biodiversity, not forgetting the terrible impact of mercury. Various Indigenous communities independently of the Association have complained about how they cannot use the water from their creeks, or eat the fish there.",
            "For its part the Association criticised the government for not doing enough to reduce the incidence and scale of mercury methylation into the environment and food chain, as well as undertake the remedial action the situation merited. It wrote that while regular inspections were required and there were stringent penalties for pollution on the books, these were ignored because of the understaffing at GGMC.",
            "The Association did discuss the restoration of mining sites, describing how a few years ago the GGMC conducted an experiment to find out how much it would cost to restore a mine site on a small scale. The estimate was $6 million, which would have undoubtedly increased today. Yet the obligatory environmental bond for restoration is a “derisory” $100,000.",
            "While as the GHRA has said, the laws and regulations should be enforced and the penalties increased, there is also the need for a massive recruitment drive to hire far more mines officers and wardens; without them nothing will happen. The Association would also like to see environmental neglect and human suffering along with bio-diversity and wildlife loss as a cost which should be added to the profits from gold mining.",
            "While that is probably unlikely to happen, what most people would like to see would be stringent measures enforced to prevent, or in some cases seriously limit the deleterious effects of mining in our hinterland. But before that can happen there would need first to be a major attitudinal change on the part of the ruling party and government, so they come to appreciate that human health, biodiversity and respect for the environment are more important than what in Shakespearean times was called ‘filthy lucre.’ There should be no more miners’ comfort releases emanating from Mr Vickram Bharrat’s Ministry. Instead we look forward to what he is going to say about stopping the violation of our interior."
        ],
        "image_paths": [],
        "url": "https://www.stabroeknews.com/2024/08/11/opinion/editorial/mining/"
    },
    {
        "title": "This Week-in-Review August 4th to August 10th",
        "date": "2024-08-14T02:24:05-04:00",
        "paragraphs": [
            "Parliament clears $40.7b in supplementary financing: Just over $40.7b in supplementary financing was approved by Parliament after around 10 hours of debate last Friday and there were clashes over several of the items particularly for the sugar industry The two sides argued over contingency funds equalling $4.57 billion intended for the agriculture sector during the 85th Sitting of the National Assembly at the Arthur Chung Conference Centre. The Government requested that amount to cover expenses from April 1 to July 30, 2024, in a bid to stabilize the rice and sugar industries. Stabroek News on Wednesday reported that GuySuCo registered whopping losses of $7.8 billion in 2021 and $10.2 billion in 2022. Further, this year it had the worst-ever first crop. Despite setting an ambitious target of 100,000 tonnes for the year, insiders suggest that even a strong second crop may not suffice to meet this goal. Defending the request from the Contingency Fund, Agriculture Minister Zulfikar Mustapha also addressed concerns about the reopening of GuySuCo estates and financial management. He noted that the Albion estate has faced electrical issues, while the Rose Hall estate processed over 2,000 tonnes of sugar, generating revenue at the average price of US$750 per tonne. Despite ongoing financial difficulties, Rehabilitation efforts include a $600 million investment to repair the Albion factory powerhouse. The Guyana Rice Development Board, another crucial player in Guyana’s agricultural arena, has been plunged into financial difficulties due to a temporary 25% reduction in commission rates designed to aid millers during the COVID-19 pandemic. This move, intended to stabilize paddy prices, has instead led to a severe financial shortfall, with the GRDB having to forgo its commission entirely. Paddy prices surged from $4000 to $4500 per bag between April and August 2024, exacerbating the GRDB’s financial strain. As the GRDB scrambles to restore its finances, questions were raised by the opposition. “Why was $524 million suddenly needed and not in February’s budget?” Opposition MP Vinceroy Jordan demanded answers, questioning the unexpected financial strain and the GRDB’s ability to manage its growing staff of 250. Mustapha attributed the crisis to unforeseen challenges, including a new paddy bug threat and complications from El Niño. With rice production holding steady, up from 610,000 tonnes to 653,000 tonnes, the sector appears resilient despite mounting issues, according to Mustapha. Yet, rising prices for white and brown rice are fueling opposition concerns. Mustapha said that the increases are  market-driven rather than supply-related, insisting that the government cannot enforce price controls on supermarkets.",
            "Sugar",
            "GuySuCo recorded losses of $7.8b in 2021, $10.2b in 2022 – Cheong: Even as GuySuCo’s audit for last year is still to be completed, projections are not bright as the corporation recorded back-to-back losses of $7.8 billion and $10.2 billion in 2021 and 2022 respectively and this year recorded the lowest first crop in its history. Newly appointed Chief Executive Officer Paul Cheong was asked by Stabroek News in an exclusive interview about losses for the period from 2021 to 2023. He provided the 2021 and 2022 figures, and disclosed that last year’s books were not yet audited. The extent of the losses in the wake of large state subventions to the industry will raise further questions about the government’s strategy. In its 2020 manifesto it had vowed to reopen three estates that were shuttered by the APNU+AFC administration. It has since reopened one, Rose Hall. In 2021, GuySuCo produced 57,995 tonnes of sugar and in 2022, 47,049 tonnes, while last year it was a little over the 60,000 tonne-target it had set at 60, 204 tonnes. The aim this year is an ambitious 100,000 tonnes, but with the first crop the lowest it has been in GuySuCo’s history, even if the second crop is strong, meeting the target seems impossible at this time. One source with knowledge of the industry and the corporation said that “even with an optimal second crop, meeting last year’s target doesn’t currently seem likely.” It is unclear what the corporation’s production cost per pound is currently but its new CEO said that it sells both packaged and bagged sugar to CARICOM and regional countries as well as North America and Europe. “Pricing is based on territory and is sensitive so we will not divulge such information,” he said when asked about costs. Production cost per pound of sugar has previously been a widely available statistic and had been the single most important metric in pursuing the failed Skeldon Sugar Modernisation Project (SSMP).  In 2020, the production cost was US42.84 cents per pound at a time when the average global price was US28 cents.  The SSMP had been aiming at around US10 cents. While not inclined to give the dismal numbers of the 2024 first crop production, Cheong said he wanted to focus on the positive as plans were forging ahead to make up and reach the set 2024 yearly target.",
            "Oil & Gas",
            "Gov’t needs to clarify ExxonMobil’s interest payments under 2016 PSA – PNCR: The People’s National Congress Reform (PNCR) has expressed worry about the inability or reluctance of the government to shed light on whether or not ExxonMobil is charging interest on its investments in the Stabroek Block and, if so, at what interest rate, and as such is calling on the administration to clarify this issue for the benefit of the Guyanese people. In a release last week, the PNCR stated its opinion that the reluctance of Vice President Bharrat Jagdeo to fully disclose information on this matter has gone beyond ‘eye pass’with it being more than likely that he himself is not on top of the situation and, worse, “does not care to be… his disdain for his responsibilities as the PPP’s oil autocrat thus represents an assault on the well-being of every Guyanese.”   It also pointed out that the matter of interest payments can potentially amount to billions of US dollars in revenue leakages, bearing in mind that given the many tens of billions of US dollars involved in developing Guyana oil fields, an interest rate of even five per cent would result in a huge expense. Such monies, it contends, could instead be used to alleviate the cost-of-living crisis, raise salaries, eradicate poverty, and meet many other urgent needs. In an effort to explain the party’s concerns, the release made reference to Annex C of the 2016 Production Sharing Agreement (PSA), which states that interest expenses are recoverable without the approval of the minister, so long as they are “consistent with market rates.” However, it was pointed out, the first Exxon audit, commissioned by the Coalition Government, explicitly declares on Page 4 that the company did not recover any interest expenses. It read, “Interest and financing costs are recoverable under the 2016 PSA. However, EEPGL confirmed during the audit period that no interest or financing charges have been included in cost recovery- the audit team has confirmed that no interest or financing costs are included in the amount presented in the Q4 2017 cost recovery statement.” Such an explicit and direct statement, the release noted, is however missing in the second Exxon Audit, commissioned by the PPP to cover US$7.3 billion in the 2018-2020 period.  It also highlighted that because the PSA allows interest expenses to be recoverable without the approval of the minister, any audit that lacks necessary thoroughness will not automatically flag them when they appear in the cost recovery bank. This in the PNCR’s view is what Jagdeo “seems not to grasp (or cares not to)” Explaining further, it noted that when the Stabroek Block operator says Guyana is not being charged interest on developments, therefore, an audit which follows the letter of the PSA may not directly reveal whether or not this is the case. As a result, it is, at minimum, incumbent upon the Government of Guyana to monitor quarterly expense reports to identify whether interest is being charged and to raise this issue with the operator if it are not living up to its word.",
            "Press freedom",
            "Guyana drops 17 spots on 2024 World Press Freedom Index: Guyana has dropped 17 spots in the press freedom rankings, moving to 77 out of a total of 180 countries listed on the 2024 World Press Freedom Index, which was compiled by Reporters without Borders (Reporters sans frontières-RSF). RSF is an international non-profit and non-governmental organisation focused on safeguarding the right to freedom of information. The recent report stated while Guyana protects freedom of speech and the right to information, “journalists who oppose the authorities face intimidation.” The report, however, later acknowledged that, “Guyana’s journalists are respected, generally protected, and allowed to do their jobs freely and independently.” And while in Guyana, journalists are rarely the target of physical acts of violence, it did point out that television investigative journalist Travis Chase’s car was shot at in December 2023. No one was charged in that incident. “Media professionals have also faced legal intimidation and suspensions. They are often bullied online by political actors and sometimes unknown persons,” the report added. It was noted that the country has a robust media landscape, with a diversity of national and regional media outlets. The report listed the main newspapers as Stabroek News, Kaieteur News, Guyana Times, and the Guyana Chronicle. It pointed out that the Guyana Chronicle is owned and controlled by the state, as is the broadcast service, the National Communications Network. Additionally, there are a number of private newscasts and online news services.  According to the 2024 report, state-owned and controlled media in Guyana compete with several private radio stations, channels and publications. “Independent and opposition media outlets struggle to compete with the advertising revenues of pro-government media outlets, which threatens their economic viability.” It added, “While there were attempts in 2020 to improve regulation of the broadcast industry, the government failed to involve or consult with any broadcasters to strengthen the reform.”",
            "Gold smuggling",
            "AG: US DoJ has acknowledged request for info on Mohameds, Toussaint Jr. Thomas: Attorney General Anil Nandlall SC says that the U.S. Department of Justice (DoJ) has acknowledged Guyana’s request for information related to sanctions imposed on businessmen Nazar Mohamed, his son Azruddin, and Permanent Secretary Mae Toussaint Jr. Thomas. However, the Attorney General indicated that obtaining the requested details will take some time. In June, the government was advised by Washing-ton that any information concerning the sanctions against the Mohamed family and Toussaint Jr. Thomas would need to be obtained through the DoJ. Following the sanctions imposed by the Office of Foreign Assets Control (OFAC) on June 11, the Guyanese government contacted U.S. authorities to request information that would support its investigation into the affected individuals. These requests were sent by Minister of Finance Dr Ashni Singh and the Commissioner General of the Guyana Revenue Authority, Godfrey Statia under the Tax Information Exchange Agreement (TIEA) between Guyana and the U.S. The TIEA allows for the exchange of information to enforce tax laws, prevent fraud, and ensure accurate tax assessments. The government anticipates that both the mutual legal assistance process and the TIEA will enable timely and effective information sharing. Singh emphasized that the government will continue to work diligently with U.S. counterparts to resolve this matter swiftly. The sanctions under the US Magnitsky Act created a furore here and underlined that Washington was looking closely at major players allegedly involved in corruption. Use of the Magnitsky Act usually denotes very serious concerns about the targets. On June 11, the United States Department of The Treasury imposed sanctions on the  Mohameds over the alleged massive smuggling of gold. Toussaint Jr Thomas, was cited for alleged corruption leading to her being immediately sent on leave by the government here. Allegations against the Mohameds include defrauding the government here of some US$50 million in taxes from smuggled gold, as well as bribing public officials. For Toussaint Jr Thomas’s part, it said that she used her office while serving at the Ministry of Home Affairs, to offer benefits to the Mohameds that included contracts, licences for weapons, and passports.",
            "Gov’t doing little to address negative impacts of gold mining – GHRA: The Guyana Human Rights Association (GHRA) is taking the government to task for failing to insulate the environment and Indigenous communities from the negative effects of gold mining and makes the case that the many benefits it accords the sector do little to encourage responsible action. In a release last week, GHRA referenced the recent statement from the Ministry of Natural Resources (MoNR) which catalogued the extensive perks, concessions and privileges extended to the gold-mining sector, including tax reductions, duty-free concessions, simplified licensing arrangements, expansion of available mining properties in conflicted areas such as Marudi Mountains, and removal of protective regulations. All this, the Association added, without mentioning the “huge environmental and human cost” perpetrated by this industry. It was noted too that the ministry’s statement concluded with a reminder that this unwavering support was “in keeping with the ruling party Manifesto prior to the last elections.” Further, the GHRA bemoaned the fact that even road-building in interior regions has become mining-driven rather than influenced by community or environmental considerations.   The release pointed out that since all mining has a significant effect on the environment, the Environmental Protection Act 1996, (Section 11) and Schedule 4, (item 9) mandates that Environmental Impact Assessments (EIA) and Environmental Permits (EP) are to be undertaken for each and every mining operation. However, according to the annual reports of the Guyana Extractive Industries Transparency Initiative (GY-EITI), the Guyana Geology & Mines Com-mission (GGMC) has not enforced such requirements for many years for the thousands of small-scale mining claims or medium-scale mining permits covering millions of hectares.  GHRA lamented the fact that most of Guyana’s prized large rivers have been reduced to health and safety hazards by gold mining, with river banks and the actual course of rivers having been altered by illegal hydraulic mining. Added to this is the failures to apply the several GGMC Codes of Practice to the waste in mine tailings now spilling polluted sediment into the creeks and rivers. “No effort has been made to apply penalties for these transgressions despite the fact that River Navigation Act (cap. 50:01, 1998) and the State Lands Act 1903/1972 (Section 22) states ‘Everyone who willfully causes any impediment to the free use or navigation of any river or navigable creek, shall be liable to a fine of ninety-seven thousand five hundred dollars, unless he has previously obtained permission under this Act or the Forests Act to cause the impediment.’”",
            "Trade",
            "US Trade Representative underlines food safety on issue of catfish exports: A block on catfish exports from Guyana to the US remains in place and Washington’s Trade Representative Katherine Tai has emphasised the importance of food safety standards. In an exclusive interview with the Sunday Stabroek at the US Embassy, the US Trade Representative addressed several issues affecting trade relations between the United States and Guyana. One significant concern has been the inability of Guyanese farmers to export catfish to the United States since 2017, a situation attributed to new regulations. When questioned by this newspaper about whether this was not a case of a non-tariff barrier that discriminates against small countries like Guyana, Ambassador Tai addressed the nature of the regulations. “I appreciate the opportunity to explain this matter…The process we’re going through regarding the imports of catfish from Guyana is part of a food safety exercise. It should not be viewed as a non-tariff barrier aimed at excluding Guyanese catfish because of the country’s size. Instead, it reflects our legitimate regulatory responsibility to ensure that all imports meet our food safety standards”, she said. Tai elaborated on the importance of sanitary and phytosanitary policies, which are designed to ensure that food products are safe for consumption. “This is a critical aspect of trade policy, governed by evidence and science. I understand that the review process can be frustrating, especially for producers who are very good at producing their product. However, it’s vital for governments to guarantee that the food supplied to our citizens is safe. Establishing trust and confidence in the regulatory systems of different countries is crucial for maintaining food safety,” she explained. Efforts to lift the US export ban on Guyanese catfish, which has been in place since September 2017 have been ongoing and it is unclear why the Department of Fisheries and the Ministry of Agriculture have yet been unable to settle the issue.  The ban has significantly impacted the local catfish industry, particularly the export of ‘gilbaka’.",
            "Guysuco",
            "Cheong confident he can make a success of GuySuCo: GuySuCo’s first crop for this year has been the lowest ever recorded but with a plan for maximising mechanisation and using technology, newly appointed Chief Executive Officer Paul Cheong said that it will reach this year’s 100,000 tonnes target. Cheong was adamant that sugar is profitable and will be a positive contributor to Guyana’s development. Not inclined to give the dismal numbers of the first crop production, Cheong said he wanted to focus on the positive as plans were forging ahead to make up and reach the set 2024 yearly target. “The first crop was bad because of El Niño… It was one of the worst crops in history,” Cheong told Stabroek News in an interview late last month. He said that the low figures were not because of poor management but mainly poor weather and the Albion estate not working. “Albion didn’t work last crop and it affected efficiency because we had to move the crop to Rose Hall… Cane deteriorates with time and you get poor recoveries,” he said. There was a major fire at the Albion Estate on February 3 this year, he recounted, as he pointed out that it resulted in extensive damage to the bus bar that housed the 4MW turbine alternator control panels. A 2.5MW control panel and interbus transformer panel and switch gears were also damaged. However, Cheong said that by the end of March they were rebuilt and testing showed no adverse effects. He informed that “full load testing with the entire factory operational will be done on the commencement of the crop. We don’t foresee any difficulty. Despite the fire, we were able to grind all of Albion’s cane at the Rose Hall Factory.” With 8,179 persons in the corporation’s employ, he said that “there are 5,368 field workers out of an establishment of 7,600.” Given the 2,232 persons deficit, he said that the corporation has intensified mechanisation to help mitigate this. And mechanisation, he underscored, was a big part of the future for GuySuCo as there are plans to adapt the industry so it can be developed  to meet the changing global times. “GuySuCo has no choice but to have its cultivation, in keeping in line with other sugar producing countries,” he reasoned. “The appropriate machines and equipment are used and 40% of GuySuCo is mechanised. Not included in this 40% is Skeldon, with 5,000 hectares fully mechanised.” Given that President Irfaan Ali has spoken about cultivating more cane at Skeldon, Cheong was also asked a number of questions about that factory during the interview.",
            "Infrastructure",
            "Damaged Coldingen Bridge leads to traffic backup: Many commuters along the East Coast Demerara corridor were left stranded last Monday morning as bus owners cancelled work because of the damaged bridge at Coldingen Railway Embankment. This resulted in a huge traffic buildup on both the main road and railway embankment. While a traffic advisory was issued on Sunday indicating emergency work was being done on the bridge resulting in sections of the railway embankment being closed it appears as if many were caught by surprise. Some passengers who were stranded at Enmore, Estate Road, East Coast Demerara. Even before 7 am there was a long line from Coldingen on the embankment and even more chaos was created as some vehicles sought to turn around to escape the line and this created hardship for those who were travelling in the opposite direction. And as vehicles attempted to make it to the main road at various points the traffic came almost to a standstill. Workers gathered on the road from about 7 am and stood for hours while several drivers en route to Golden Grove, Victoria and Anns Grove emptied their buses and refused to travel back to Georgetown. The traffic buildup lasted for hours. While taxis seemed to be an alternative for others to make their way to work, they were forced to wait for hours in the traffic. After bus drivers signalled that they were not going to Georgetown, some people decided to call taxis but were told that none was available. People gathered at street corners as they waited in vain for a bus to arrive to be transported to Georgetown.  Persons living along the railway embankment utilized the Enterprise Road to gain access to the public road but also came into contact with other drivers who diverted from the traffic at Enmore, Estate Road.",
            "Electricity",
            "Blackouts for Bartica as three engines down – GPL: The Guyana Power and Light (GPL) last week apologized to customers in Bartica, Region Seven for the recent service interruptions  as a result of three engines being down. This latest generation problem will call into question the management of key infrastructure as a new power plant had been commissioned in Bartica in December 2019. In a statement yesterday, GPL said that the Bartica Power Plant has four engines: two are required to meet the demand, while two serve as a standby unit. “Unfortunately, we have only one operational engine in conjunction with the solar farm”, it said. The unavailability of the three critical units has resulted in a reduced generation at the Bartica Power Plant, prompting the need for scheduled service interruption in the township. It said that customers from Acatash North, Byderabo Front Road, 1st Avenue South, 1st to 9th Street and 1st to 3rd Avenue North were to experience an interruption in service from 15:00hrs – 23:00hrs. Customers from Acatash South, Dog Point, 1 to 5 Mile Potaro and West Indian Housing Scheme were to be repowered from approximately 15:00hrs to 19:00hrs Customers from Mongrippa Hill, Byderabo Back Road, Carribese Hill, Old Housing, Bamford Point 2nd, 3rd, and 4th, Avenue South, 4th to 7th Avenue North were to be repowered from approximately 19:00hrs – 23:00hrs.",
            "Crime",
            "Suspect in murder of lawyer dies after ingesting poison: Tony Sulker, the 29-year-old police sergeant who became a prime suspect in the murder of lawyer Richard Layne after CCTV footage was viewed last week, died last night at the GPHC after ingesting poison. On Wednesday, Layne was found dead in a locked car with a wound to his neck. Sulker, who lived with Layne in Century Palm Gardens, D’Urban Backlands had initially told police that he had found the body at around 10 pm. CCTV footage viewed by the police yesterday however contradicted this and it was after further questioning by the police that Sulker ingested poison and was rushed to the  Georgetown Public Hospital (GPHC) where he died last night. A post-mortem examination conducted yesterday on the body of Layne revealed that he died from a stab wound to the neck.  Dr Nehaul Singh, performed a post-mortem examination with dissection on the body of Layne, 35. The body was identified by a cousin, Michael Harding, and brother, Ryan Layne. Dr Singh stated the cause of death to be a stab wound to the neck going from left to right with a sharp instrument. It was at least 17 cm in length. On Thursday, the Guyana Police Force had reported that they were investigating the murder of the attorney. The killing occurred between 9.30 pm and 10.13 pm at the same address.  According to a police statement issued last evening, Sulker was interviewed by detectives on Thursday, and in a written statement, he disclosed that he met Layne about four years ago at a function at the Marriott Hotel in Georgetown. After they became friends, Layne asked him to move in with him and he started living at the address about four years ago. Sulker said he and Layne never had any problems. Sulker went on to say that on the night in question, he was at home with Layne when Layne’s cousin, Michael Harding, visited the house and shortly after, Harding and Layne left.",
            "Mocha man knifed to death during robbery: Ken Sukhdeo, a 33-year-old of Mocha, East Bank Demerara, was killed during a robbery on Wednesday night at Vreed-en-Rust, East Bank Demerara. Reports are that one suspect is in custody while police are looking for the other. According to the police, Sukhdeo was robbed of his black Toyota Allion, PWW 455, three cell phones including one Samsung Galaxy S24 Ultra, and a shoulder bag with a small amount of US and Guyana currency. Investigations revealed that Sukhdeo drove his car at about 8:10 pm to the Seven Eleven Chinese Supermarket located in Diamond. He was accompanied by his 23-year-old Venezuelan girlfriend, Feranda Perez. At the supermarket, he met the two suspects, 19-year-old Louie Angadle, and 19-year-old Jose Harrland, both of 19th Avenue, Diamond. Both teens, who are Venezuelan nationals, were known to Sukhdeo and his girlfriend as they would normally give Sukhdeo US currency to send to their respective families in Venezuela. The two suspects entered the back seat of the car, and Sukhdeo drove to Vreed-en-Rust, where Angadle allegedly pulled out a knife and proceeded to stab Sukhdeo about his head and body. Mean-while, the other suspect, Harrland, who was also armed with a knife, also stabbed the victim several times about his body.  Sukhdeo managed to stop the car and ran out, leaving his girlfriend in the car where the two suspects turned their attack on her. She managed to escape. The two suspects then drove away in the car, eventually crashing it at Little Diamond New Hous-ing Scheme, East Bank Demerara, and made their escape on foot with the victim’s black shoulder bag containing documents and money. Both Perez and Sukhdeo were taken to the Diamond Diagnostics Centre where Perez was treated for wounds to her upper leg and breast. Sukhdeo succumbed to his injuries and was pronounced dead.",
            "Fire",
            "Disabled teen perishes in fire at Imbaimadai: A disabled teenage boy perished in a fire at Imbaimadai Village, Region Seven (Cuyuni- Mazaruni), on Augist 2nd. Region Seven Chairman Kenneth Williams told Stabroek News yesterday that the incident occurred on Friday evening. The boy was identified as 18-year-old Lendon Cornelius, who was left at home unattended. The Guyana Fire Service is expected to launch an investigation to determine the cause of the fire. Villagers are also clueless as to how the fire started."
        ],
        "image_paths": [],
        "url": "https://www.stabroeknews.com/2024/08/14/sunday/the-week-in-review/this-week-in-review-august-4th-to-august-10th/"
    },
    {
        "title": "Thirty GuySuCo workers from Blairmont certified on workplace safety",
        "date": "2024-06-09T02:02:27-04:00",
        "paragraphs": [
            "The Guyana Sugar Corporation (GuySuCo) Blairmont Estate is now poised to enhance its focus on workers’ safety and health as it has undergone its first round of comprehensive training for members of the Joint Workplace Safety and Health Committee (JWSHC).",
            "Thirty persons benefitted from the three-day training, which was conducted -from Tuesday, June 4, to Thursday, June 6, 2024, by the Ministry of Labour’s Occupational Safety and Health (OSH) Department, in collaboration with the National Insurance Scheme (NIS).",
            "OSH Officer,  Neza King, Region Five (Mahaica-Berbice) OSH Officer,  Babita Singh, and Region Six (East Berbice-Corentyne) OSH Officer,  Nazmoon Jafarally, led the interactive training sessions at the Blairmont Estate boardroom in Region Five ,  a release from the Ministry of Labour said.",
            "The sessions covered key topics including Categories of Hazards, Types of Hazards at Work, Controls for hazards, Sources of Hazards, Risk Assessment, Physical and Mental Health in the workplace, and the OSH Act, Chapter 99:06 of the Laws of Guyana, among other topics.",
            "Following the training, both participants and their workplaces received certification that would be valid for one year.",
            "Every workplace with more than 20 employees, Guyana’s OSH Act mandates the creation of a Joint Workplace Safety and Health Committee."
        ],
        "image_paths": [],
        "url": "https://www.stabroeknews.com/2024/06/09/news/guyana/thirty-guysuco-workers-from-blairmont-certified-on-workplace-safety/"
    },
    {
        "title": "Labour ministry conducts  probes, inspections at NAMILCO, Pritipaul Singh Investments",
        "date": "2025-06-18T02:06:51-04:00",
        "paragraphs": [
            "Officers from the Ministry of Labour’s Occupational Safety and Health (OSH) Department yesterday conducted critical workplace inspections and accident investigations at two major facilities on the East Bank of Demerara.",
            "A release from the Ministry of Labour said that the inspection team included OSH Officers  Ray Hosannah and Delcina Small, alongside University of Guyana student interns  Michelle Hercules and Susana Benjamin-Reece. It undertook the exercise at Pritipaul Singh Investments Inc., and the National Milling Company of Guyana (NAMILCO).",
            "The team surveyed  various workplace conditions to ensure compliance with the Occupational Safety and Health Act, Chapter 99:06.",
            "Focus areas included the presence of hygienic restroom facilities, implementation of occupational health and safety systems, and the general well-being of employees on site.",
            "Following the evaluations, the release said that the team held a safety talk for employees who were previously involved in a non-fatal workplace accident. The session focused on critical aspects of Occupational Safety and Health, including the identification of workplace hazards, accident prevention strategies, proper reporting procedures, and fall protection measures.",
            "A list of recommendations was issued to the management of both facilities to improve OSH compliance and workplace safety standards. The companies were given a one-month period to correct all breaches identified during the inspections."
        ],
        "image_paths": [
            "./scraper/stabroak/Labour ministry conducts  probes, inspections at NAMILCO, Pritipaul Singh Investments_img_2.png"
        ],
        "url": "https://www.stabroeknews.com/2025/06/18/news/guyana/labour-ministry-conducts-probes-inspections-at-namilco-pritipaul-singh-investments/"
    },
    {
        "title": "Labour ministry hosts occupational health and safety training for  public sector employees",
        "date": "2024-08-23T02:03:04-04:00",
        "paragraphs": [
            "The Ministry of Labour, Occupational Health and Safety Department is collaborating with the Ministry of Public Service-Training and Development Department, to host a three-day Occupational Health and Safety (OSH) workshop at the Public Service Ministry’s Training and Development Complex, Vlissengen Road & D’Urban Street, Wortmanville, George-town, a Ministry of Labour release stated on Tuesday.",
            "The programme which commenced on August 20, aims to equip participants – 43 employees from approximately 25 government agencies and ministries – with the knowledge needed to promote a conscious awareness of occupational safety and health at work.",
            "According to the release, the workshop is spearheaded by Assistant Chief Occupation Safety and Health Officer, Roydon Croal. Topics that will be covered are: Introduction to Occupational Safety and Health, Workplace Hazards, Occupational Safety and Health Act, Joint Workplace Safety and Health Committee, Occupational Safety and Health Policy, Occupational Safety and Health Manage-ment Systems, Workplace Inspections, Accident Prevention and Investigation.",
            "Participants will also be exposed to short video clips of the topics, with practical exercises such as presentations, and group work, the release added."
        ],
        "image_paths": [
            "./scraper/stabroak/Labour ministry hosts occupational health and safety training for  public sector employees_img_2.png"
        ],
        "url": "https://www.stabroeknews.com/2024/08/23/news/guyana/labour-ministry-hosts-occupational-health-and-safety-training-for-public-sector-employees/"
    },
    {
        "title": "Normalizing unsafe conditions",
        "date": "2025-06-05T02:12:02-04:00",
        "paragraphs": [
            "Dear Editor,",
            "As a Public Communications Analyst, I frequently move across regions, engaging with local businesses and organizations. In doing so, I’ve observed a troubling trend that runs deep within our Guyanese culture: a widespread disregard for basic safety and public health standards. Too often, actions are justified with the phrase, “This is Guyana — this is how we do things.” Unfortunately, this mindset has become ingrained, allowing unsafe practices to persist in our daily lives.",
            "Take our road infrastructure, for example. Many roads are uneven and poorly maintained, unfit for emergency vehicles. Major intersections still lack stoplights, and motorcyclists riding without helmets is a routine sight — a glaring, preventable risk. The issue extends to buildings, old and new. Many older structures still rely on outdated electrical systems, creating serious fire hazards. Even recent constructions sometimes fail to meet modern safety standards, making them dangerous for occupancy.",
            "Environmental hazards also go largely unaddressed. Communities near forested areas frequently encounter snakes and other wildlife, yet basic measures — such as clearing overgrown lots, educating residents, or providing pest control — are often absent. Children and the elderly are especially vulnerable, but the risks are routinely ignored. Food safety presents another major concern. Food is regularly sold at unsafe temperatures, and it’s not uncommon to see vendors handling food without gloves or while visibly ill. These unsanitary practices are a direct threat to public health, exacerbated by poor enforcement and a lack of public awareness.",
            "All these examples point to a larger cultural complacency — the normalization of unsafe conditions. But safety and public health are not privileges; they are basic rights. We must change the narrative. Progress starts with rejecting the idea that tradition excuses negligence. We must demand better infrastructure, stronger enforcement, and greater accountability from both leaders and ourselves. A safer, healthier Guyana is possible for all once we continued efforts are made.",
            "Sincerely,",
            "Blane R. Bunbury",
            "Public Communications Analyst"
        ],
        "image_paths": [],
        "url": "https://www.stabroeknews.com/2025/06/05/opinion/letters/normalizing-unsafe-conditions/"
    },
    {
        "title": "GWI project from Croal St to Broad St not being properly done",
        "date": "2025-03-19T02:06:45-04:00",
        "paragraphs": [
            "Dear Editor,",
            "It is of grave concern to me, as it should be to all citizens, that Guyana Water Incorporated has recently embarked on a pipe laying project on High Street which has resulted in the excavation of the road from Croal Street to Broad Street. This project is still ongoing and has resulted in extensive destruction to the road itself, massive and extended inconvenience to the flow of traffic, a drastic increase in the amount of dust and sand along the street which is posing a health hazard to hundreds if not thousands of people daily, and numerous safety hazards to commuters along the street.",
            "It is my contention that this project was poorly planned out and hurriedly executed without enough forethought to ensure that it would be executed efficiently, effectively and safely. The disregard for safety has been one of my main concerns as I’ve continuously witnessed poor health and safety practices by GWI that could result in serious injury or death to those who travel through the construction area.",
            "Attached are just a few photos taken on High Street, between Princes and Broad streets where work is currently ongoing but seems to be at a standstill. At first glance you would think this is an abandoned construction zone, but it’s quite active with what seems to be makeshift safety devices that really don’t do much to warn anyone of how dangerous the site is.",
            "I’m requesting that the relevant personnel at GWI examine this construction zone thoroughly and implement the necessary measures to address the following:",
            "The lack of safety signs and barricades to prevent unnecessary accidents that can result in serious injury or death.",
            "The repair of areas where pipe laying is finished to prevent the further destruction of a relatively good road, saving Guyana’s valuable resources.",
            "A thorough cleanup of dust and debris left behind due to the project, allowing citizens to breathe and traverse comfortably.",
            "I expect GWI to take these points seriously and address them quickly and effectively for the benefit of all.",
            "Sincerely,",
            "Darrell Carpenay",
            " "
        ],
        "image_paths": [
            "./scraper/stabroak/GWI project from Croal St to Broad St not being properly done_img_2.png",
            "./scraper/stabroak/GWI project from Croal St to Broad St not being properly done_img_3.png"
        ],
        "url": "https://www.stabroeknews.com/2025/03/19/opinion/letters/gwi-project-from-croal-st-to-broad-st-not-being-properly-done/"
    },
    {
        "title": "Labour Ministry hosts OSH training for GWI personnel",
        "date": "2024-10-17T02:01:14-04:00",
        "paragraphs": [
            "In its ongoing efforts to bolster workplace safety and health awareness across all sectors in Guyana, the Ministry of Labour’s (MoL) Occupational Safety and Health (OSH) Department is currently facilitating a two-day Joint Workplace Safety and Health Committee Training Programme with several employees of Guyana Water Incorporated (GWI).",
            "According to a MoL release on Tuesday, the training is designed to educate participants on critical safety topics, including the benefits provided by the National Insurance Scheme (NIS) and the legal requirement to report workplace accidents and diseases to the NIS. In addition, participants will receive sensitisation training on Human Immunodeficiency Virus/Acquired Immunodeficiency Syndrome (HIV/AIDS).",
            "The programme is being led by Occupational Safety and Health Officers, Neza King and Johana Vaughn, with support from NIS Training Officer, Dane Chesney, along with Training Officer from the National AIDS Programme Secretariat (NAPS), Dr Jagnarine. Together, they will prepare members of GWI’s Joint Workplace Safety and Health Committee to effectively fulfill their responsibilities as outlined in the Occupational Safety and Health (OSH) Act.",
            "Further, participants will gain essential skills to create and maintain safe workplace practices, with the ultimate goal of reducing workplace accidents. This hands-on training will also enable attendees to demonstrate a comprehensive understanding of their roles as Joint Workplace Safety Committee Representatives.",
            "Upon completing the programme, participants will be equipped to conduct workplace inspections, investigate accidents, and implement strategies to manage or eliminate hazards. Both the workplace and participants will receive a two-year certification, affirming their commitment to a safe and healthy work environment, the release added."
        ],
        "image_paths": [],
        "url": "https://www.stabroeknews.com/2024/10/17/news/guyana/labour-ministry-hosts-osh-training-for-gwi-personnel/"
    },
    {
        "title": "Employee rights and obligations under the Occupational Safety and Health Act",
        "date": "2025-05-04T02:01:45-04:00",
        "paragraphs": [
            "By Chevy Devonish and Frances Carryl",
            "Guyana celebrated Labour Day on Thursday, May 1st, 2025. This national holiday is intended to commemorate the accomplishments of trade unions and the labour rights – including occupational safety and health rights – recognised, attained, and protected over the years.",
            "This said, Guyana’s rapid oil-driven economic development has witnessed a monumental increase in public and private projects. Public works include the new Demerara Harbour Bridge, a deep-water port in Berbice, various road construction and repair initiatives, and the gas-to-energy project. Private works encompass multiple offshore development projects, including the operations of the accompanying floating production storage and offloading vessels and the construction of numerous hotels.",
            "Given these developments, it is appropriate to examine some of the rights employees have under Guyana’s Occupational Safety and Health Act, Cap 99:10, Laws of Guyana (OSHA), particularly since Minister of Labour Joseph Hamilton stated that 2024 saw a 45% increase in workplace fatalities compared to 2023. The increased fatalities were attributed to increased activity in the mining sector.",
            "Breaking down OSHA",
            "Employers have a fundamental duty to create and maintain a safe working environment. This includes ensuring that equipment, machinery, chemicals, biological agents, and the general work environment do not pose health risks (see sections 46[2] and 47[1] of OSHA). Employers must also implement prescribed safety measures and procedures and ensure that workers comply with these requirements (see sections 45[1] and 46[1] of OSHA). Additionally, they must provide suitable equipment, protective devices, and clothing while maintaining them in good condition (see section 46[1] of OSHA). Workers must also receive adequate training, information, and supervision to protect their health and safety (see section 46[2] of OSHA). Moreover, employers are obligated to immediately report workplace accidents causing fatalities or serious injuries to the Occupational and Health Safety Authority (a special body established under OSHA) and all other accidents within four days (see sections 69 and 70 of OSHA).",
            "Supervisors, or those in charge of workplaces or with authority over workers, play a critical role in maintaining health and safety. They must ensure that workers use protective devices and follow the prescribed safety measures (see section 48[1] of OSHA). Additionally, supervisors are responsible for informing workers about potential hazards and providing written instructions on protective measures (see section 48[2] of OSHA). They must also take reasonable steps to protect workers from harm (see section 482]).",
            "Employees bear essential responsibilities to uphold workplace safety. Workers must wear protective devices, use equipment properly, and report any defects or hazards to their employer or supervisor (see section 49[1] of OSHA). They must also care for their employer’s personal protective equipment, devices, and clothing (see section 49[1] of OSHA). Workers must not remove or disable protective devices without first implementing an adequate temporary replacement. Once the need for removal no longer exists, they must immediately restore the original protective device (see section 49[2] of OSHA).",
            "Additionally, workers must avoid behaviours that could compromise safety, such as engaging in pranks, contests, feats of strength, unnecessary running, or rough conduct (see section 49[2] of OSHA). At the same time, they are entitled to critical protections. For one, employers are prohibited from dismissing, disciplining, suspending, intimidating, or penalising workers for acting in compliance with the Act or seeking enforcement of their rights (see section 58[1] of OSHA). Furthermore, workers are entitled to refuse work if they reasonably believe that equipment or workplace conditions pose an imminent and serious danger to their health or safety (see section 56[1] of OSHA).",
            "Any employer or employee who contravenes any of the provisions commits a criminal offence, whether intentionally or negligently.",
            "Ultimately, workplace health and safety is a shared responsibility. Employers, supervisors, and employees must work together to uphold the standards set out in OSHA.",
            "By understanding and fulfilling these responsibilities, we can prevent accidents, save lives, and cultivate safer work environments.",
            "Frances Carryl is an Attorney-at-law admitted to practice in Guyana and St Vincent and the Grenadines. She specialises in litigation, environmental law, oil and gas law, and corporate law."
        ],
        "image_paths": [
            "./scraper/stabroak/Employee rights and obligations under the Occupational Safety and Health Act_img_2.png"
        ],
        "url": "https://www.stabroeknews.com/2025/05/04/sunday/employee-rights-and-obligations-under-the-occupational-safety-and-health-act/"
    },
    {
        "title": "Safety standards",
        "date": "2025-06-04T02:01:45-04:00",
        "paragraphs": [
            "Last Friday, the Policy Implementation Work-shop for the Adoption of the National Policy Guidelines for the Transportation, Storage, and Erection of Concrete Poles was held at the Arthur Chung Conference Centre. The event, which was facilitated by the Office of the Prime Minister, brought together senior officials from Guyana Power and Light (GPL), the Ministry of Public Works, Ministry of Housing and Water, contractors, engineers, and stakeholders to review and adopt the new framework.",
            "The policy aims to standardise procedures across the sector, improve the quality and safety of installations, and ensure long-term durability and stability. It mandates the transition of the direct burial method of traditional wooden poles to the installation of high quality concrete poles on approved foundation systems. The guidelines were drafted and refined by the technical working team from the GPL and the Miscellaneous and Urban Roads Department.",
            "Addressing the workshop, Prime Minister Mark Phillips observed that the guidelines are, “timely and necessary. Perhaps we never had such a document before, but now we have a standard from which we can demand consistency in quality.” Phillips stated that the initiative is a response to frequent public complaints about the alignment and quality of utility poles, whilst noting that these structures require specialised handling due to Guyana’s challenging alluvial soil and environmental conditions.",
            "Phillips called for the establishment or strengthening of an Inspectorate Department to certify works prior to final payment, stressing that such oversight is crucial to ensuring compliance. “It is not just about setting rules – it is about improving how we work together to ensure safety, reliability, and public confidence in our infrastructure,” Phillips stated.",
            "“We [the Government] take the brunt of the criticism because we are elected to serve, but we need our technical teams and contractors to work to the standards set out in this policy. If we do it right, positive perception will follow,” Phillips added.",
            "Whilst the government has to be commended for the development and implementation of this policy guideline for critical infrastructure, a lot more attention is required in the complementary area of labour input; namely, the monitoring and enforcement of Occupational Health and Safety (OSH) standards. The International Labour Organisation (ILO) provides detailed labour conventions, protocols, and recommendations for occupational hazards in the workplace which can affect workers’ health and safety. These dangers can be categorized into six main types: biological, chemical, ergonomic, physical, safety, and work organization hazards. Each category presents unique risks, ranging from exposure to harmful substances to physical strain and psychosocial stressors. Many of these risks – most notably with regard to biological, chemical, or physical hazards – can be readily reduced by strongly enforcing the use of personal protective equipment (PPE).",
            "Every day we witness glaring examples of workers being unnecessarily exposed to hazardous conditions due to the lack of PPE. Last Saturday morning, a five-man crew from Guyana Water Incorporated (GWI) was working in Fort Street, Kingston, just north of Barrack Street. Two workers descended into the sewer via a manhole, neither of whom was clad in any significant form of protective clothing. Hazard suits, breathing apparatus, safety googles, masks and gloves were all absent. The October 1997 incident where two employees of the then Georgetown Sewerage and Water Commissioners had collapsed in a manhole and were rescued by a good samaritan, appears to have been forgotten. The workers had been overcome by poisonous fumes, and it was only due to the heroic efforts of a passerby, Christopher ‘Chrissie’ Stevenson, who lost his own life as a consequence, that the unconscious men were brought to the surface, and later recovered to recount the horrific ordeal.",
            "The construction boom has brought its own bundle of potential hazards. While passing building sites in the midst of high-rise steel assembly, it is not uncommon to see workers perched on H-beams three or four storeys above the ground without a safety harness securely attached to a shock absorber and lanyard system. Equally disturbing to observe, is the delivery of sand or stone by one of the oversize trucks after it has trampled through the city. Upon arrival at the site, the driver, who will quite often block traffic in both directions by angling his vehicle across the street, will exit the cab to sneak a peek of the driveway prior to discharging the contents of the tray. During his descent, onlookers will notice the lack of a safety vest and the seemingly preferred choice of footwear, rubber slippers or sandals (to keep their feet cool?). Rubber slippers, or sandals and vehicle pedals are a recipe for an inevitable disaster.",
            "The current installation of raised concrete drains on both sides of the East Bank Demerara Road within the narrow confines of the village of Golden Grove (commonly referred to as Grove) has been a formula for chaos. As the traffic virtually claws its way along the undulating crumpled roadway, one sees many workers mixing, fetching, pouring, or plastering cement, nary a face adorned with a mask, as gusts of sand and cement dust swirl in the atmosphere. Likewise, visits to construction sites will reveal artisans cutting tiles sans safety masks (or googles), seemingly oblivious to the long-term dangers posed to human lungs by the resulting fine dust particles.",
            "These are just a few of the glaring examples one can discern on a daily basis within the city. One can only imagine what other violations of OSH standards are taking place in outlying areas where authority oversight is less likely to occur. One notable exception is the oil and gas industry (the employees are being held to foreign standards) where the workers are always smartly attired in hard hats, safety vests, steel toe boots and bright overalls.",
            "Whilst the onus is on the government to ensure compliance with the OSH protocols, the standard must be set by employers. Unfortunately, not all owners or management can be bothered that their most valuable asset, their workers, could be exposed to biological hazards such as bacteria, viruses or fungi, or chemical dangers such as pesticides and industrial materials. Presenting workers with flimsy masks and inexpensive colourful safety vests adorned with reflective stripes as is the wont of unscrupulous owners, will not suffice. All workers deserve to receive the highest standards of PPE as mandated by their respective industries. It is owed to them, and the government has an obligation to ensure that they receive same."
        ],
        "image_paths": [],
        "url": "https://www.stabroeknews.com/2025/06/04/opinion/editorial/safety-standards/"
    },
    {
        "title": "Twenty-seven deaths in construction industry over last four years",
        "date": "2024-08-29T02:12:49-04:00",
        "paragraphs": [
            "-Labour Ministry hosts seminar to improve safety",
            "As part of its efforts to foster safe working environments across industries and combat workplace fatalities, the Ministry of Labour’s Occupational Safety and Health (OSH) Department yesterday hosted a workshop at the Regency Suites Hotel in Georgetown, to promote safety and health in the construction sector, a Department of Public Information (DPI) release stated yesterday.",
            "The seminar which attracted some 80 participants from the public and private sector, featured presentations on proper safety and health practices tailored to the construction industry. There was also a panel discussion, where recommendations were made to enhance workplace safety by implementing robust safety and health practices.",
            "According to the DPI, the event was organised in response to numerous complaints from workers regarding safety issues in the sector. Over the past four years, there have been 27 fatalities in the construction sector, with six recorded in 2020, five in 2021, five in 2022, seven in 2023, and four in 2024.",
            "Minister of Labour Joseph Hamilton, who was a keynote speaker at the event, stressed the importance of prioritising safety and health in all workplaces, calling it a national concern. “…Whether it’s the public or private sector, safety and health is all of our business… It is a national matter and we have to fix it.”",
            "He emphasised the need for continued efforts to reduce workplace fatalities, while noting the ministry’s progress in this area. And while he acknowledged that the construction sector is prone to hazards, he asserted that such risks can be mitigated through proper safety and health measures. ",
            "Hamilton told the gathering that any company that employs more than 19 employees is required to have a health and safety committee. He also expressed confidence that stakeholders would leave the seminar equipped with the necessary tools to uphold safety and health standards at their workplaces.",
            "“I would hope that after we finish here today, you would see the [need] to support what we are doing. And that you would see the need to do everything possible to protect yourself, your coworkers, business owners, and our staff.”   ",
            "Meanwhile, Divisional Director of QHSE and Operational Support at Guyana Power Light (GPL), Gary Hall, described the seminar as timely, bringing stakeholders together to address a critical issue.",
            "OSH Consultant, Gweneth King also delivered remarks at the seminar, the release added."
        ],
        "image_paths": [
            "./scraper/stabroak/Twenty-seven deaths in construction industry over last four years_img_2.png"
        ],
        "url": "https://www.stabroeknews.com/2024/08/29/news/guyana/twenty-seven-deaths-in-construction-industry-over-last-four-years/"
    },
    {
        "title": "New Thriving on Main St instals fire  extinguisher after deficiency pointed out",
        "date": "2024-08-16T02:04:47-04:00",
        "paragraphs": [
            "-poor housekeeping practices also observed",
            "On Monday,  Senior Occupational Safety and Health (OSH) Officer Darwin Bourne and OSH Officer Ray Hosannah  visited the New Thriving Restaurant on Main Street, Georgetown to investigate a complaint.",
            "A release yesterday from the Ministry of Labour said that during their inspection, the officers assessed the generator fuel storage area and discovered that there were no fire protection measures in place to ensure the safety and health of the workers in that area.",
            "As a result, a recommendation was made by the officers that a 4.5kg fire extinguisher be installed in the generator fuel storage area, positioned at least one meter above ground level. This included improving the restaurant’s housekeeping standards.",
            "“In response to the recommendations, Mr. Sang of New Thriving Restaurant took prompt action by installing a 4.5kg Carbon Dioxide fire extinguisher for the generator, which was subsequently inspected and confirmed to be in working condition”, the release said.",
            "The officers further recommended that basic fire prevention training be provided to staff, with a focus on the use, maintenance, and proper placement of fire extinguishers. They also provided additional recommendations to deal with the poor housekeeping practices observed during the inspection.",
            "The release said that these recommendations are in keeping with the Section 46 Subsection 2 (a)&(d) of the Occupational Safety and Health Act Chapter 99:06 Laws of Guyana which requires employers to do the following:",
            "(a) Provide information, instruction and supervision to a worker to protect the safety and health of the worker.",
            "(d) Acquaint a worker or a person in authority over a worker of any hazard in the work and handling, storage, use, disposal and transport of any article, device, equipment, chemical, physical agent or biological agent."
        ],
        "image_paths": [],
        "url": "https://www.stabroeknews.com/2024/08/16/news/guyana/new-thriving-on-main-st-instals-fire-extinguisher-after-deficiency-pointed-out/"
    },
    {
        "title": "Six labour officers get training in confined workspace safety",
        "date": "2024-07-05T02:05:04-04:00",
        "paragraphs": [
            "Health and safety officers of the Ministry of Labour (MoL) are now able to ensure that labourers who operate in confined workspaces can do so safely.",
            "According to a MoL release, Six Occupational Safety and Health (OSH) officers have achieved this competency following a one-day training course in Confined Space Entrant and Attendant Training. This is essential for individuals working in enclosed spaces with limited entry and exit, such as tanks, pits, vats, silos, or vessels.",
            "It was conducted on Thursday, June 27 by HHSL Safety Systems (Guyana) Inc, and facilitated by Course Instructor and Emergency Medical Technician, Preslee Paul, the release said.",
            "It explained that the tailored course ensures that the OSH officers possess the knowledge and skills to identify hazards, assess risks, use proper safety equipment, implement rescue procedures, work safely within confined spaces, and protect themselves and their colleagues from potential dangers associated with confined spaces.",
            "Further, the course complements additional training exercises being undertaken by officers of the OSH Department, and is part of MoL’s efforts to ensure that all personnel are properly equipped with the skills necessary to effectively function within their roles.",
            "Participants of the training also received certification that will be valid for the next three years.",
            "Benefitting from the training were Assistant Chief OSH Officers, Roydon Croal and Maxean Bess; Senior OSH Officer, Darwin Bourne; and Regional OSH Officers, Babita Singh, Nazmoon Jafarally, and Naipaul Persaud, the release added."
        ],
        "image_paths": [
            "./scraper/stabroak/Six labour officers get training in confined workspace safety_img_2.png"
        ],
        "url": "https://www.stabroeknews.com/2024/07/05/news/guyana/six-labour-officers-get-training-in-confined-workspace-safety/"
    },
    {
        "title": "Labour ministry inspects city construction sites",
        "date": "2024-04-13T02:07:25-04:00",
        "paragraphs": [
            "Yesterday, officers from the Ministry of Labour’s Occupational Safety and Health (OSH) Department inspected multiple construction sites along Oronoque, Robb, and Charlotte streets in Georgetown.",
            "A release from the ministry said that the activities are part of continuous workplace inspections being conducted in the construction, restaurant, and business services sectors countryside.",
            "The team, which comprised Delcina Small and Ray Hosannah, checked to ensure that fire safety mechanisms, hygienic restroom facilities, and other occupational health and safety practices were implemented.",
            "Following the evaluation, the release said that safety talks were done with construction employees on proper OSH protocols concerning workplace hazards, accident prevention and reporting of accidents and fall protection, provided with a list of recommendations to create safe and healthy work environments, and given one month to correct the breaches made under the Occupational Safety and Health Act, Chapter 99:06.",
            "The release pointed out that the powers of the OSH officers enable them to “enter, inspect, and examine any Industrial Establishment and every part thereof at any hour of the day or night”.",
            "During the Inspection by the OSH Officer, the following documents will be requested.",
            "1. Accident Register",
            "2. Occupational Safety and Health (OSH) Policy",
            "– To be posted in a conspicuous place in the workplace",
            "3. Occupational Safety and Health (OSH) Act, Chapter 99:06",
            "– To be posted in a conspicuous place in the workplace",
            "4. HIV/AIDS Policy",
            "– Required for Industrial Establishments with over five employees (all businesses in Guyana)",
            "5. OSH Registration",
            "– First Registration (1000), Renewal (500) Yearly",
            "During the inspection by the OSH officer, the following would be inspected:",
            "6. First Aid Kit- Adequate supplies",
            "– Note: No tablets should be a part of the kit.",
            "7. Fire Extinguishers",
            "– To be mounted and serviced yearly.",
            "8. Potable Drinking Water- to be provided.",
            "9. Housekeeping",
            "10. Washroom facilities",
            "– For both genders (Male and Female)"
        ],
        "image_paths": [
            "./scraper/stabroak/Labour ministry inspects city construction sites_img_2.png"
        ],
        "url": "https://www.stabroeknews.com/2024/04/13/news/guyana/labour-ministry-inspects-city-construction-sites/"
    },
    {
        "title": "As Guyana’s structural buildout grows JTW Management institute announces July 25 OSH forum",
        "date": "2024-07-19T02:10:54-04:00",
        "paragraphs": [
            "With the physical transformations, not least the multi-sectorial makeover ‘explosion’ unfolding in Guyana, the need for the burnishing of the country’s Occupational Safety and Health (OSH) profile has become a matter of the utmost urgency. This reality is illustrated in the fact that even at the inception of what is expected to be a protracted process of physical across-the-country structural transformation, the fragility of Guyana’s OSH regime has continually shown up through workplace accidents/tragedies, many of which are believed to have been avoidable. ",
            "With the vast extent of the country’s ‘makeover’ agenda now becoming increasingly apparent, the privately-run JTW Management Training Institute Inc. continues to fashion its curriculum to respond to the extant and emerging needs of both the public and private sectors. Specifically, the range of the entity’s expertise embraces corporate training, adult education and workplace development, among other specializations.",
            "At a juncture when the local construction ‘building’ sector is fashioning its own transformations to ‘fit in’ with the country’s envisaged development profile, the various facets of its pursuits will require an enhanced sensitivity to considerations that embraces the upgrading of the workplace culture to place enhanced emphasis on disciplines that enhances the standing of the workplace, not least, Occupational Health and Safety.",
            "Following the staging of the country’s second international investment conference staged in Georgetown earlier this month which attracted global attention, the JTW Institute has announced that it is seeking to raise awareness of the importance of OSH through a One Day Occupational Health and Safety Seminar on Thursday July 25, 2024.",
            "During previous interviews with this newspaper, Ms. Joycelyn T. Williams has contended that the extent of the growth and expansion which Guyana is now experiencing and the occupational safety and health implications that arise therefrom require an intimate knowledge of the country’s OSH laws and regulations. This, she believes, will render Guyana’s investment profile more universally attractive given the assurances that it will provide that critical laws governing the various aspects of workplace safety and health are not only known but strictly adhered to.",
            " Information provided to the Stabroek Business indicates that the forum will be addressed by Chairman of the National Advisory Council on Occupational Safety and Health, Earl Morris, and will allow discourse on provisions that govern the Occupational Safety and Healthy rules and practices in Guyana. The forum is designed to allow for involved interaction on issues that include understanding and applying the provisions of the Occupational Safety and Health legislation; The Roles & Responsibilities of the Employer & Employees; What to do in the event of an Accident or Occupational Disease in the Workplace; Hazard Identification & Risk Assessment.  "
        ],
        "image_paths": [
            "./scraper/stabroak/As Guyana’s structural buildout grows JTW Management institute announces July 25 OSH forum_img_2.png",
            "./scraper/stabroak/As Guyana’s structural buildout grows JTW Management institute announces July 25 OSH forum_img_3.png"
        ],
        "url": "https://www.stabroeknews.com/2024/07/19/business/as-guyanas-structural-buildout-grows-jtw-management-institute-announces-july-25-osh-forum/"
    },
    {
        "title": "FAO hosts training for seabob fishers",
        "date": "2024-10-18T02:05:22-04:00",
        "paragraphs": [
            "As part of its efforts to increase awareness on emerging local and international market requirements related to quality and safety of seabob products, from harvesting through to preparation, the Food and Agriculture Organization of the United Nations (FAO), in collaboration with the Caribbean Regional Fisheries Mechanism (CRFM), conducted a two-day “Training of Trainers” workshop for workers in the seabob sector.",
            "This was stated in a release by the FAO which noted that seabob (Xiphopenaeus kroyeri), a shrimp species harvested from the Atlantic Ocean, is one of Guyana’s key exports, with the country being one of the world’s leading exporters.",
            "According to the FAO release, this is the first in a series of planned trainings in this crucial area with the first cohort and comprised some 15 participants from the Fisheries Department, Ministry of Agriculture, and Pritipaul Singh Investment (PSI), a leading private sector processing firm.",
            "Key focus areas of the workshop included a deeper understanding of food safety principles, hazard analysis and critical control points (HACCP), the importance of food safety standards for enhancing market access, as well as strategies to further reduce waste and minimize public health risks.",
            "FAO Representative, Dr Gillian Smith, noted that this mix of public and private sector participants is important to ensure that stakeholders across the value chain have the right information to increase the opportunities for reaching new and demanding markets. Further, participation in the workshop also marks a step toward a long-term commitment to improving food handling and safety in seabob production.",
            "Meanwhile, trainers from CRFM disclosed that before the end of this year, more training will be offered to other industry stakeholders and to interested vendors and fishers. The FISH4ACP project will also assist stakeholders in developing and implementing a comprehensive Occupational Safety and Health (OSH) Strategy for the seabob value chain. This will help to drive a strategy to enhance safety across the industry, further reducing the risk of injury and illness to workers and fisherfolk along the seabob value chain.",
            "These initiatives are part of the FISH4ACP Programme which is implemented by FAO and the seabob industry, with funding from the European Union (EU), the release added.",
            "FISH4ACP is a five-year €40 million programme led by the Organisation of African, Caribbean and Pacific States (OACPS) that aims to tackle some of the underlying challenges to sustainable fisheries and aquaculture."
        ],
        "image_paths": [
            "./scraper/stabroak/FAO hosts training for seabob fishers_img_2.png",
            "./scraper/stabroak/FAO hosts training for seabob fishers_img_3.png"
        ],
        "url": "https://www.stabroeknews.com/2024/10/18/news/guyana/fao-hosts-training-for-seabob-fishers/"
    },
    {
        "title": "Protecting informal workers from extreme heat",
        "date": "2024-08-29T02:01:38-04:00",
        "paragraphs": [
            "By Laura Alfers and Christy Braham",
            "JOHANNESBURG/WASHINGTON, DC – Today’s escalating climate crisis disproportionately affects the world’s two billion informal workers. As heat waves become increasingly frequent and intense, the absence of global occupational safety and health (OSH) protections against climate-related risks leaves these workers dangerously exposed. Forced to labor in record-breaking temperatures, their health and even lives are in jeopardy.",
            "In 2022, the International Labor Organization (ILO) declared a “safe and healthy working environment” a fundamental right. But although many countries have recognized extreme heat as an occupational hazard and implemented workplace-safety protections, these measures rarely extend to the world’s most vulnerable workers: those working informally in fields, landfills, street markets, and homes.",
            "More than 2.4 billion workers worldwide are exposed to extreme heat annually. With heat stress projected to increase rapidly over the next few decades, the international community must urgently reform labor-protection frameworks to ensure workers’ health, safety, and livelihoods. Without decisive action, millions will continue to suffer needlessly, trapped in a cycle of rising temperatures and hazardous working conditions.",
            "This danger is particularly acute in low- and middle-income countries, where informal jobs account for roughly 90% of total employment. While data on these workers’ health and safety are limited, a growing body of research suggests that extreme heat has a profoundly negative impact on their well-being and livelihoods.",
            "For example, research by Women in Informal Employment: Globalizing and Organizing (WIEGO) and the University of Sheffield found that 85% of waste pickers in Brazil experienced heat stress in 2022 and 2023, resulting in serious health risks and reduced productivity. In Delhi, where temperatures breached 50° Celsius in May, the death of a 53-year-old laborer prompted the lieutenant governor to issue new guidelines adjusting laborers’ working hours and expanding access to drinkable water. As a recent World Health Organization editorial notes, the severe effects of extreme heat on informal workers include an increased risk of skin cancer.",
            "While discussions about protecting informal workers from heat stress often focus on outdoor laborers such as farmers and street vendors, extreme heat also affects those who work indoors in poorly ventilated spaces with limited access to potable water. In Brazil, a waste picker told WIEGO researchers that “the heat is sometimes unbearable. Being inside a shed, which has a zinc roof, affects everyone.” Finding sustainable cooling solutions is also important for domestic workers and caretakers, most of whom are women.",
            "But despite recent advances on establishing global OSH standards, policymakers face significant challenges in addressing the issue. Notably, 64% of informal workers are self-employed. Without employers to finance essential safety measures, economically vulnerable workers must use their limited resources to protect themselves. As Yuleina Carmona, WIEGO’s Mexico City coordinator, observed, “Those who work on the street buy their own water, carry their umbrellas, wear hats, and mitigate the effects of the heat with their own resources.”",
            "This weakness reflects a disconnect between local and national policymakers. In urban areas, informal workplaces are typically regulated by municipal authorities that rarely coordinate with national labor agencies responsible for workplace safety. Moreover, informal workers are often stigmatized and seen as an undesirable source of crime and urban blight.",
            "Even when national and local authorities manage to coordinate their efforts, significant gaps remain. India’s heat action plans, for example, aim to tackle climate-related risks across multiple levels of government. But these plans overlook the realities of informal work and the need for targeted interventions at the municipal level, particularly in densely populated urban areas.",
            "While establishing global norms and standards is necessary, they must be translated into concrete measures that protect informal workers in the regions most affected by rising temperatures. In particular, local and municipal authorities must adopt inclusive labor regulations and invest heavily in appropriate infrastructure, including expanded access to potable water, shade, indoor ventilation, and high-quality occupational health services. To prevent the rise in morbidity and mortality rates associated with heat stress, these services must be affordable, adequately funded, and accompanied by structural shifts at the national level to provide vital income support to workers grappling with climate-related displacement.",
            "Informal worker organizations are already leading the way. In Zimbabwe, informal traders have convinced Masvingo’s city council to approve public investment in critical urban infrastructure. In India, the Self-Employed Women’s Association, one of the world’s largest worker organizations for women in informal employment, recently launched its own insurance program that enables beneficiaries to avoid working during dangerous heat waves.",
            "In addition to such worker-driven solutions, OSH protections must be integrated into climate policies. As heat-related hazards continue to evolve and intensify, a staggering number of workers – including those in informal employment – face the risk of chronic illness, death, and disability. Without coordinated action, the future of work will be increasingly dangerous and uncertain, leaving millions of workers to face the brunt of the climate crisis.",
            "Copyright: Project Syndicate, 2024.",
            "www.project-syndicate.org"
        ],
        "image_paths": [
            "./scraper/stabroak/Protecting informal workers from extreme heat_img_2.png",
            "./scraper/stabroak/Protecting informal workers from extreme heat_img_3.png"
        ],
        "url": "https://www.stabroeknews.com/2024/08/29/features/project-syndicate/protecting-informal-workers-from-extreme-heat/"
    }
]