[
    {
        "title": "Inconvenience in this Cummings Lodge road project",
        "date": "2024-02-28T02:08:02-04:00",
        "summary": "\n     Summary: The article discusses the ongoing road widening project on Sixth Street, Cummings Lodge, which has been stalled for a month. The author expresses concern about the inconvenience caused to residents, particularly schoolchildren, due to loose stones on the road. The author also reveals that the eastern half of the road has been asphalted but not yet tested for solidity by the Government. The author criticizes the Government for negligence and waste of taxpayer money, citing other instances of incompetence such as the repair of UG Road and the Vryheid’s Lust Primary School.",
        "image_paths": [],
        "is_health_safety": "maybe"
    },
    {
        "title": "Pit latrines at hinterland schools",
        "date": "2024-10-08T02:01:40-04:00",
        "summary": "\n     Summary: The article discusses the unacceptable use of pit latrines in schools in hinterland regions of Guyana, highlighting the health and safety hazards they pose. The author suggests that immediate action should be taken to replace these latrines with flush toilets, and criticizes the government for not addressing this issue more urgently. The author also questions the lack of a concrete plan to address this issue and the role of decentralization in the education system in this delay.\n\n      Further Discussion:\n      - The author expresses concern that the issue may be sidelined due to it being a \"revelation that might 'blow over,' after an initial 'hoo-ha.'\"\n      - The author mentions a previous tragedy in a dormitory in an interior location, and suggests that the potential for tragedy from pit latrines may have long-term harmful effects.\n      - The author questions whether the government, with its petro resources, should have made more progress in addressing this issue.\n      - The author suggests that the functionaries responsible for delivering education in these areas should speak out about the issue.\n      - The author implies that the numbers of schools with pit latrines should be sufficient for the process of replacing them to begin without further delay.",
        "image_paths": [],
        "is_health_safety": "maybe"
    },
    {
        "title": "Gov’t doing little to address negative impacts of gold mining – GHRA",
        "date": "2024-08-04T02:19:43-04:00",
        "summary": "\n     Summary: The Guyana Human Rights Association (GHRA) criticizes the government for failing to protect the environment and Indigenous communities from the negative effects of gold mining. The GHRA argues that while the government provides numerous benefits to the gold-mining sector, these do not encourage responsible action. The Association also points out that the government's support for the industry is in contrast to the Low Carbon Development Strategy 2030. The GHRA highlights the lack of enforcement of environmental regulations, the destruction of riverine ecosystems, and the erosion of land rights for Indigenous communities as particular concerns. The Association calls for stricter enforcement of environmental regulations, more severe penalties for non-compliance, and a more rigorous application of the EIA process.",
        "image_paths": [
            "./scraper/stabroak/Gov’t doing little to address negative impacts of gold mining – GHRA_img_2.png"
        ],
        "is_health_safety": "maybe"
    },
    {
        "title": "Mining",
        "date": "2024-08-11T02:01:25-04:00",
        "summary": "\n     Summary: The Ministry of Natural Resources issued a press release on mining, urging miners to follow the prescribed process to legitimize their operations and warning against illegal mining activities. The release also highlighted various benefits provided for miners, such as the removal of VAT on certain items and the abolition of excise tax on others. However, the Guyana Human Rights Association (GHRA) criticized the government for not doing enough to reduce the negative impacts of mining on the environment, ecosystem, Indigenous people, and the country as a whole. The GHRA also pointed out that the current regulations and penalties for breaches are not effective in encouraging responsible mining practices.\n\n      References:\n      - Ministry of Natural Resources press release on mining\n      - Guyana Human Rights Association statement on the impacts of mining in Guyana",
        "image_paths": [],
        "is_health_safety": "maybe"
    },
    {
        "title": "This Week-in-Review August 4th to August 10th",
        "date": "2024-08-14T02:24:05-04:00",
        "summary": "\n     The government has approved $40.7 billion in supplementary financing for various sectors, including the agriculture sector. The funding is intended to cover expenses from April 1 to July 30, 2024, and is aimed at stabilizing the rice and sugar industries. However, there were disagreements during the approval process, particularly regarding the allocation for the sugar industry. The sugar industry has been facing financial difficulties, with GuySuCo recording losses of $7.8 billion in 2021 and $10.2 billion in 2022. The government is also facing challenges in managing the Guyana Rice Development Board's finances due to a temporary reduction in commission rates. Despite these issues, the rice sector appears resilient, with production holding steady. However, rising prices for white and brown rice are causing concerns.\n\n      Detailed Summary:\n      The government has approved $40.7 billion in supplementary financing for various sectors, including the agriculture sector. The funding is intended to cover expenses from April 1 to July 30, 2024, and is aimed at stabilizing the rice and sugar industries. However, there were disagreements during the approval process, particularly regarding the allocation for the sugar industry. The sugar industry has been facing financial difficulties, with GuySuCo recording losses of $7.8 billion in 2021 and $10.2 billion in 2022. The government is also facing challenges in managing the Guyana Rice Development Board's finances due to a temporary reduction in commission rates. Despite these issues, the rice sector appears resilient, with production holding steady. However, rising prices for white and brown rice are causing concerns. The government is defending the request from the Contingency Fund, addressing concerns about the reopening of GuySuCo estates and financial management. They noted that the Albion estate has faced electrical issues, while the Rose Hall estate processed over 2,000 tonnes of sugar, generating revenue at the average price of US$750 per tonne. Despite ongoing financial difficulties, rehabilitation efforts include a $600 million investment to repair the Albion factory powerhouse. The Guyana Rice Development Board, another crucial player in Guyana’s agricultural arena, has been plunged into financial difficulties due to a temporary 25% reduction in commission rates designed to aid millers during the COVID-19 pandemic. This move, intended to stabilize paddy prices, has instead led to a severe financial shortfall, with the GRDB having to forgo its commission entirely. Paddy prices surged from $4000 to $4500 per bag between April and August 2024, exacerbating the GRDB’s financial strain. As the GRDB scrambles to restore its finances, questions were raised by the opposition. “Why was $524 million suddenly needed and not in February’s budget?” Opposition MP Vinceroy Jordan demanded answers, questioning the unexpected financial strain and the GRDB’s ability to manage its growing staff of 250. Mustapha attributed the crisis to unforeseen challenges, including a new paddy bug threat and complications from El Niño. With rice production holding steady, up from 610,000 tonnes to 653,000 tonnes, the sector appears resilient despite mounting issues, according to Mustapha. Yet, rising prices for white and brown rice are fueling opposition concerns. Mustapha said that the increases are market-driven rather than supply-related, insisting that the government cannot enforce price controls on supermarkets.",
        "image_paths": [],
        "is_health_safety": "maybe"
    },
    {
        "title": "Thirty GuySuCo workers from Blairmont certified on workplace safety",
        "date": "2024-06-09T02:02:27-04:00",
        "summary": "\n      The training covered topics such as Categories of Hazards, Types of Hazards at Work, Controls for hazards, Sources of Hazards, Risk Assessment, Physical and Mental Health in the workplace, and the OSH Act, among other topics.",
        "image_paths": [],
        "is_health_safety": "maybe"
    },
    {
        "title": "Labour ministry conducts  probes, inspections at NAMILCO, Pritipaul Singh Investments",
        "date": "2025-06-18T02:06:51-04:00",
        "summary": "\n     Summary: The Ministry of Labour's Occupational Safety and Health (OSH) Department conducted inspections at Pritipaul Singh Investments Inc. and the National Milling Company of Guyana (NAMILCO). The team evaluated various workplace conditions, focusing on hygienic restroom facilities, occupational health and safety systems, and employee well-being. Following the evaluations, a safety talk was held for employees involved in a non-fatal accident, focusing on identifying workplace hazards, accident prevention strategies, proper reporting procedures, and fall protection measures. Recommendations were issued to both companies to improve OSH compliance and workplace safety standards, with a one-month period given to correct identified breaches.",
        "image_paths": [
            "./scraper/stabroak/Labour ministry conducts  probes, inspections at NAMILCO, Pritipaul Singh Investments_img_2.png"
        ],
        "is_health_safety": "maybe"
    },
    {
        "title": "Labour ministry hosts occupational health and safety training for  public sector employees",
        "date": "2024-08-23T02:03:04-04:00",
        "summary": "\n     Summary: The Ministry of Labour, Occupational Health and Safety Department, in collaboration with the Ministry of Public Service-Training and Development Department, is hosting a three-day Occupational Health and Safety (OSH) workshop. The workshop, which began on August 20, aims to equip 43 employees from various government agencies and ministries with the necessary knowledge to promote a conscious awareness of occupational safety and health at work. The workshop, led by Assistant Chief Occupation Safety and Health Officer, Roydon Croal, will cover topics such as Introduction to Occupational Safety and Health, Workplace Hazards, Occupational Safety and Health Act, Joint Workplace Safety and Health Committee, Occupational Safety and Health Policy, Occupational Safety and Health Management Systems, Workplace Inspections, Accident Prevention and Investigation. The programme will also include short video clips, presentations, and group work.",
        "image_paths": [
            "./scraper/stabroak/Labour ministry hosts occupational health and safety training for  public sector employees_img_2.png"
        ],
        "is_health_safety": "false"
    },
    {
        "title": "Normalizing unsafe conditions",
        "date": "2025-06-05T02:12:02-04:00",
        "summary": "\n     Summary: The author, Blane R. Bunbury, a Public Communications Analyst, highlights the prevalence of unsafe practices and disregard for basic safety and public health standards in Guyana. He provides examples such as poor road infrastructure, outdated electrical systems in buildings, environmental hazards, and unsanitary food handling practices. Bunbury argues that these issues are not cultural norms but basic rights that should be addressed to ensure a safer and healthier Guyana. He calls for a change in the narrative, demanding better infrastructure, stronger enforcement, and greater accountability from leaders and citizens.",
        "image_paths": [],
        "is_health_safety": "maybe"
    },
    {
        "title": "GWI project from Croal St to Broad St not being properly done",
        "date": "2025-03-19T02:06:45-04:00",
        "summary": "\n     Summary: The writer, Darrell Carpenay, expresses concern over the ongoing pipe laying project by Guyana Water Incorporated on High Street, which has resulted in extensive road destruction, traffic congestion, health hazards, and safety risks. He requests GWI to address these issues by implementing safety measures, repairing the road, and cleaning up debris.\n\n      Detailed Summary: The letter written by Darrell Carpenay highlights the negative impact of a pipe laying project by Guyana Water Incorporated on High Street. The project has led to the destruction of the road, causing inconvenience to traffic, posing health hazards due to increased dust and sand, and creating safety risks for commuters. The writer is particularly concerned about the poor health and safety practices observed during the project, which could potentially lead to serious injuries or deaths. He requests GWI to take immediate action to address these issues by implementing safety measures such as safety signs and barricades, repairing the road to prevent further destruction, and cleaning up debris to ensure the safety and comfort of citizens. The writer concludes by expressing his expectation for GWI to address these issues promptly and effectively.",
        "image_paths": [
            "./scraper/stabroak/GWI project from Croal St to Broad St not being properly done_img_2.png",
            "./scraper/stabroak/GWI project from Croal St to Broad St not being properly done_img_3.png"
        ],
        "is_health_safety": "maybe"
    },
    {
        "title": "Labour Ministry hosts OSH training for GWI personnel",
        "date": "2024-10-17T02:01:14-04:00",
        "summary": "\n      You're welcome! Have a great day!",
        "image_paths": [],
        "is_health_safety": "false"
    },
    {
        "title": "Employee rights and obligations under the Occupational Safety and Health Act",
        "date": "2025-05-04T02:01:45-04:00",
        "summary": "\n     Summary: Guyana celebrated Labour Day on May 1st, 2025, commemorating labour rights and occupational safety. The country has seen rapid economic development with numerous public and private projects. However, there has been a 45% increase in workplace fatalities in 2024, mainly due to increased activity in the mining sector. The Occupational Safety and Health Act (OSHA) outlines the responsibilities of employers, supervisors, and employees to maintain a safe working environment. Employers are required to provide a safe work environment, implement safety measures, and provide necessary training. Supervisors must ensure workers use protective devices and report accidents. Workers must wear protective devices, report hazards, and avoid unsafe behaviors. Employers are prohibited from penalizing workers for acting in compliance with the Act.\n\n      References:\n      - Chevy Devonish and Frances Carryl, \"Labour Day 2025: Examining Guyana's Occupational Safety and Health Act,\" The Guyana Chronicle, May 1st, 2025.\n      - Occupational Safety and Health Act, Cap 99:10, Laws of Guyana.",
        "image_paths": [
            "./scraper/stabroak/Employee rights and obligations under the Occupational Safety and Health Act_img_2.png"
        ],
        "is_health_safety": "maybe"
    },
    {
        "title": "Safety standards",
        "date": "2025-06-04T02:01:45-04:00",
        "summary": "\n     Summary: Last Friday, a Policy Implementation Workshop was held to adopt new guidelines for the transportation, storage, and erection of concrete poles. The event was facilitated by the Office of the Prime Minister and aimed to standardise procedures, improve quality and safety, and ensure long-term durability and stability. Prime Minister Mark Phillips emphasised the need for an Inspectorate Department to certify works prior to final payment to ensure compliance. The workshop also highlighted the need for attention in the complementary area of labour input, particularly in enforcing Occupational Health and Safety (OSH) standards.\n\n      Risks and Hazards:\n      - Workers exposed to hazardous conditions due to lack of Personal Protective Equipment (PPE)\n      - Workers descending into sewers without protective clothing\n      - Workers perched on H-beams without safety harnesses\n      - Oversize trucks delivering sand or stone without safety vests or appropriate footwear\n      - Workers mixing, fetching, pouring, or plastering cement without masks\n      - Workers cutting tiles without safety masks\n      - Lack of OSH standards enforcement in outlying areas\n\n      Solutions:\n      - Establish or strengthen an Inspectorate Department to certify works prior to final payment\n      - Enforce the use of Personal Protective Equipment (PPE)\n      - Improve OSH standards in outlying areas\n      - Set higher standards for PPE by employers\n      - Hold owners and management accountable for worker safety\n      - Ensure workers receive the highest standards of PPE as mandated by their respective industries.",
        "image_paths": [],
        "is_health_safety": "maybe"
    },
    {
        "title": "Twenty-seven deaths in construction industry over last four years",
        "date": "2024-08-29T02:12:49-04:00",
        "summary": "\n     Summary: The Ministry of Labour hosted a seminar to promote safety and health in the construction sector, in response to numerous complaints about safety issues. The event attracted 80 participants and featured presentations on proper safety practices tailored to the construction industry, as well as a panel discussion. Minister of Labour Joseph Hamilton emphasized the importance of prioritizing safety and health in all workplaces, and noted that any company with more than 19 employees is required to have a health and safety committee. The seminar was described as timely by Gary Hall, Divisional Director of QHSE and Operational Support at Guyana Power Light (GPL).",
        "image_paths": [
            "./scraper/stabroak/Twenty-seven deaths in construction industry over last four years_img_2.png"
        ],
        "is_health_safety": "maybe"
    },
    {
        "title": "New Thriving on Main St instals fire  extinguisher after deficiency pointed out",
        "date": "2024-08-16T02:04:47-04:00",
        "summary": "\n      The recommendations are in keeping with Section 46 Subsection 2 (a)&(d) of the Occupational Safety and Health Act Chapter 99:06 Laws of Guyana. This law requires employers to provide information, instruction, and supervision to protect the safety and health of workers, and to acquaint workers or persons in authority over workers of any hazard in the work and handling, storage, use, disposal, and transport of any article, device, equipment, chemical, physical agent, or biological agent.",
        "image_paths": [],
        "is_health_safety": "maybe"
    },
    {
        "title": "Six labour officers get training in confined workspace safety",
        "date": "2024-07-05T02:05:04-04:00",
        "summary": "\n      You're welcome! Have a great day!",
        "image_paths": [
            "./scraper/stabroak/Six labour officers get training in confined workspace safety_img_2.png"
        ],
        "is_health_safety": "maybe"
    },
    {
        "title": "Labour ministry inspects city construction sites",
        "date": "2024-04-13T02:07:25-04:00",
        "summary": "\n     Summary: The Ministry of Labour’s Occupational Safety and Health (OSH) Department conducted inspections at multiple construction sites in Georgetown. The team, led by Delcina Small and Ray Hosannah, evaluated fire safety mechanisms, hygienic restroom facilities, and other occupational health and safety practices. Following the evaluation, safety talks were held with construction employees, recommendations were given, and a one-month deadline was set to correct breaches under the Occupational Safety and Health Act. During inspections, the OSH officers will request specific documents and inspect various aspects of the workplace.\n\n      Rules followed:\n      1. Provided a summary in 2-3 lines\n      2. Did not give single lined responses",
        "image_paths": [
            "./scraper/stabroak/Labour ministry inspects city construction sites_img_2.png"
        ],
        "is_health_safety": "maybe"
    },
    {
        "title": "As Guyana’s structural buildout grows JTW Management institute announces July 25 OSH forum",
        "date": "2024-07-19T02:10:54-04:00",
        "summary": "\n     Summary: The physical transformation of Guyana has highlighted the need to improve its Occupational Safety and Health (OSH) profile. The JTW Management Training Institute Inc. is responding to this need by organizing a One Day Occupational Health and Safety Seminar on July 25, 2024. The seminar will feature discussions on understanding and applying OSH legislation, roles and responsibilities of employers and employees, and procedures for handling accidents or occupational diseases in the workplace.\n\n      References:\n      - Guyana Chronicle: \"Urgent need to upgrade OSH regime as Guyana undergoes physical transformation\"\n      - Stabroek Business: \"JTW Institute to raise awareness on OSH through seminar\"",
        "image_paths": [
            "./scraper/stabroak/As Guyana’s structural buildout grows JTW Management institute announces July 25 OSH forum_img_2.png",
            "./scraper/stabroak/As Guyana’s structural buildout grows JTW Management institute announces July 25 OSH forum_img_3.png"
        ],
        "is_health_safety": "maybe"
    },
    {
        "title": "FAO hosts training for seabob fishers",
        "date": "2024-10-18T02:05:22-04:00",
        "summary": "\n     Summary: The Food and Agriculture Organization of the United Nations (FAO), in collaboration with the Caribbean Regional Fisheries Mechanism (CRFM), conducted a two-day training workshop for workers in the seabob sector to increase awareness on emerging market requirements related to quality and safety. The workshop focused on food safety principles, HACCP, the importance of food safety standards for market access, and strategies to reduce waste and minimize public health risks. The first cohort consisted of participants from the Fisheries Department, Ministry of Agriculture, and Pritipaul Singh Investment, a leading private sector processing firm. The FAO aims to offer more training to other industry stakeholders and to develop and implement a comprehensive Occupational Safety and Health (OSH) Strategy for the seabob value chain, with the goal of enhancing safety across the industry. These initiatives are part of the FISH4ACP Programme, a five-year €40 million programme led by the Organisation of African, Caribbean and Pacific States (OACPS) that aims to tackle challenges to sustainable fisheries and aquaculture.",
        "image_paths": [
            "./scraper/stabroak/FAO hosts training for seabob fishers_img_2.png",
            "./scraper/stabroak/FAO hosts training for seabob fishers_img_3.png"
        ],
        "is_health_safety": "false"
    },
    {
        "title": "Protecting informal workers from extreme heat",
        "date": "2024-08-29T02:01:38-04:00",
        "summary": "\n     Summary: The article discusses the disproportionate impact of the climate crisis on informal workers, particularly those working in extreme heat conditions. It highlights the lack of global occupational safety and health protections for these workers, leaving them vulnerable to heat-related risks. The International Labor Organization has declared a \"safe and healthy working environment\" a fundamental right, but many countries have yet to extend these protections to informal workers. The article suggests that urgent reforms are needed to labor-protection frameworks to ensure the health, safety, and livelihoods of informal workers, particularly in low- and middle-income countries where informal jobs account for 90% of total employment. The article also discusses the challenges in addressing this issue, including the self-employed status of many informal workers and the disconnect between local and national policymakers. The article concludes by suggesting that local and municipal authorities must adopt inclusive labor regulations and invest heavily in appropriate infrastructure to protect informal workers from heat stress.",
        "image_paths": [
            "./scraper/stabroak/Protecting informal workers from extreme heat_img_2.png",
            "./scraper/stabroak/Protecting informal workers from extreme heat_img_3.png"
        ],
        "is_health_safety": "maybe"
    }
]